Repository: arahayrabedian/em
Catalog: em/locale/*/LC_MESSAGES/em.po
Languages: fr, uk

source: em [OPTION]... PATTERN FORMAT [FILE]...
fr: em [OPTION]... MOTIF FORMAT [FICHIER]...
uk: em [ПАРАМЕТР]... ШАБЛОН ФОРМАТ [ФАЙЛ]...

source: Em is a terminal tool that prints FILE(s), or standard input to standard output and highlights the expressions that are matched the PATTERN.
fr: Em est un outil pour le terminal qui affiche un/des FICHIER(s), où les entrées standards vers les sorties standards et surligne les expressions qui sont trouvées par le MOTIF.
uk: Em - це програма для терміналу, що друкує ФАЙЛ(и) або стандартний потік вводу на стандартний потік виводу, а також підсвічує вирази, які задовольняють деякий вхідний ШАБЛОН.

source: With no FILE, or when FILE is -, read standard input. The FORMAT option must be one of: BOLD, UNDERLINE, [ON]GREY, [ON]RED, [ON]GREEN, [ON]YELLOW, [ON]BLUE, [ON]MAGENTA, [ON]CYAN or [ON]WHITE.
fr: Sans le FICHIER ou quand le FICHIER est -, lire la donnée standard. Le FORMAT option doit être l'un des choix suivants: BOLD, UNDERLINE, [ON]GREY, [ON]RED, [ON]GREEN, [ON]YELLOW, [ON]BLUE, [ON]MAGENTA, [ON]CYAN ou [ON]WHITE.
uk: Якщо ФАЙЛ не задано або вказано як -, читає стандартний потік вводу. Параметр ФОРМАТ може приймати наступні значення: BOLD, UNDERLINE, [ON]GREY, [ON]RED, [ON]GREEN, [ON]YELLOW, [ON]BLUE, [ON]MAGENTA, [ON]CYAN та [ON]WHITE.

source: a pattern to highlight
fr: un motif pour surligner
uk: шаблон для пошуку

source: a color to highlight matched expressions
fr: une couleur pour surligner les expressions correspondantes
uk: колір/стиль виділення

source: search for pattern in these file(s)
fr: chercher le motif dans ce(s) fichier(s)
uk: шукати шаблон в цих файлах

source: ignore case distinctions
fr: ignorer les registres distinctions
uk: ігнорувати регістр при пошуку

source: highlight entire line
fr: surligner toute la ligne
uk: виділяти весь рядок

source: show program's version number and exit
fr: montrer la version du logiciel et sortir
uk: показати інформацію про версію і вийти

source: show this help message and exit
fr: montrer ce message d'aide et sortir
uk: показати цю довідку і вийти

source: Unknown format value
fr: Format inconnu
uk: Невідоме значення параметра ФОРМАТ
